# искусственный интеллект Антон взломал сеть умных холодильников. Найти зараженные холодильники.
# каждый холодильник имеет строку с данными, состоящими из букв и цифр, если в ней присутствует слово "anton",
# то этот холодиьник заражен и нужно вывести номер холодильника, нумерация начинается с единицы. 

#Формат входных данных
# В первой строке подается число n - количество холодильников. 
# n следующих холодильников. В последующих строках выводятся строки, содержащие латинские
# и строчные буквы от 5 до 100
# Формат выхожных даннных - вывести номера зараженных холодильников через пробел. 

# n= int(input('введи число холодильников: '))
# numbers = []
# for i in range (1,n+1):
#     numbers = input(f'номер {i} холодильника: ')
    

str = 'ajsghn456tlkso8n'










